src/test/resources/walletpayment/enableWallet/enableWalletRequestMinimal.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns2:enableWalletRequest xmlns="http://obj.ws.payline.experian.com" xmlns:ns2="http://impl.ws.payline.experian.com">
            <ns2:contractNumber>contractNumber</ns2:contractNumber>
            <ns2:cardInd>1</ns2:cardInd>
            <ns2:walletId>5</ns2:walletId>
        </ns2:enableWalletRequest>
    </S:Body>
</S:Envelope>